#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	int x;
	int y;

	cout << "Введите до какого числа считать квадраты: ";
	cin >> x;

	cout << "\t таблица квадратов: \n";
	cout << "\t ------------------\n\n";
	cout << " Число \t\t" << "Квадрат числа\n";
	cout << "----- \t\t" << "-------------\n\n";

	for (int i = 1; i <= x; i++)

	{
		y = i * i;
		cout << i << " \t\t" << y << "\n";
	}

	cout << endl;

	system("pause");

	return 0;
}
